app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO `blogs` (`name`, `about`, `created_at`, `updated_at`) VALUES ('Blog 1', 'Sobre el blog', '2015-05-16 01:35:18', '2015-05-16 01:35:18')

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE `blogs` SET `about` = 'Sobre el blog 1', `updated_at` = '2015-05-16 01:36:23' WHERE `blogs`.`id` = 1

    def set_blog
      @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1